app/controllers/api/v1/bookmarks_controller.rb

def index
  bookmarks = Bookmark.all
---
SELECT "bookmarks".* FROM "bookmarks"