app/controllers/api/v1/shows_controller.rb

def index
  shows = Show.all
---
SELECT "shows".* FROM "shows"

def search

    term = params[:search]

    url = "http://api.tvmaze.com/search/shows?q=#{term}"

    response = RestClient.get(url)
    shows = JSON.parse(response)


      created_shows = shows.map do |x|

      Show.find_or_create_by(
        name: x["show"]["name"],
        official_site: x["show"]["officialSite"],
        thumbnail: x["show"]["image"]["medium"],
        img_url: x["show"]["image"]["original"],
        summary: x["show"]["summary"]
      )
---
INSERT INTO "shows" ("name", "official_site", "thumbnail", "img_url", "summary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "shows".* FROM "shows" WHERE "shows"."name" = $1 AND "shows"."official_site" IS NULL AND "shows"."thumbnail" = $2 AND "shows"."img_url" = $3 AND "shows"."summary" = $4 LIMIT $5